{
    "posts": [
        "Oh look, what a great example of why people should stop stealing shit.",
        "I do not understand why there’s a CRUSH option on fizz, but not a NEMESIS option…",
        "Takes one to know one",
        "I JUST GOT MY DREAM JOB OFFER OH MY GOD IM ACTUALLY FREAKING OUT IM SO HAPPY WTF",
        "Hinman moving to Foco is the best change this college has had in years",
        "Rihanna concert tonight featuring the Eagles and Chiefs ",
        "ranvir’s music video this, datamatch that. hello?! a student here released a REAL original song last week and y’all still haven’t blown it up",
        "“At Dartmouth, all you need is your Dartmouth ID to get into any frat!”",
        "That is called a letter",
        "You're in her DM's, I\nbought a mansion across\nthe bay from her home\nwhere I stare at a green\nlight emanating from her\ndock everynight while I\nthrow lavish parties\nhoping someday she'll\nshow up.",
        "Heartbreak.",
        "The water fountain on FFB no longer takes 5 minutes to refill",
        "I went out until four. I just woke up, no idea how I got home. I have seven pages due tomorrow, zero words. I have no regrets. I will get this done, and I will get an A. I always do. ",
        "None of these people were brothers and we removed them. Please dm me if there are specific peoples’ names and we will blacklist them asap.",
        "Me when I miss my 9L and fail to learn about the natural world ",
        "CS1 Midterm practice doc going crazy in T-2 hours before the exam ",
        "Every girl in foco giving a full recap of last night to their friends",
        "mentally i’m here!",
        "Never had a high school romance, who’s tryna giggle and hold hands and get really nervous about kissing while we lay in the grass and listen to music or something",
        "Dartmouth reported 59 cases of student rape on campus from 2019-2021. That’s nearly 2  per month & doesn’t include unreported cases. This is sad & life changing. Please be safe & *always* get consent.",
        "The best feeling in the world is seeing the joy on your friend’s face when you see each other for the first time since getting to campus. ",
        "What the hell is this",
        "upvote if you think open relationships never work (i’m trying to explain this to my girlfriend) ",
        "Hanover rn",
        "Forgot I had this! My parents took a photo of me the first day back from break. ",
        "Authors who make the last 10 pages of an article references",
        "The devil works hard but Chi Gam works harder ",
        "Pi Kap, Zete, AXA in that order",
        "Neither know how to fight, neither have been in a fight, both will say “if you touch me I’ll sue!”, and psi u wins the suit because their daddy has more money",
        "I realized that I start every convo w my bf, so I intentionally avoided texting first just to see how long it’d take him to text me and he still hasn’t texted after 2 days lmao",
        "Watching a 8-year old music video of happy- Pharell Williams made me apply to Dartmouth. Since then I always wanted to recreate that video on Dartmouth campus and here’s it with everyone in it: ",
        "Full version of Stanford banned words list",
        "Yes but it’s a mail dominated space",
        "it is absolutely heinous that none of my profs have cancelled class due to the cold",
        "Dartmouth students walking from CECS to LSC (colorized, 2023)",
        "26 + narp alert\n25 + no bids alert\n24 + still on campus alert\n23 + no job lined up alert",
        "name goes insanely hard",
        "On the off chance that my ex voted on this poll, I want to go ahead and clarify on his behalf that he dated 3 people at Dartmouth, but at the same time!",
        "College Republicans right now",
        "It is windy as fuck",
        "when i walk outside with wet hair and it doesn’t freeze instantly",
        "CK ‘25 CS 30",
        "why was the chi gam darty the most fun i’ve had this entire term",
        "HBG? More like H Be Jesus because that man is a god.",
        "chi gam aphis >>> tdx aphis",
        "tbh is novack open",
        "🥰✨",
        "groupme has a sexy new UI update",
        "what time does the gym open tomorrow?",
        "CS 30 has got me acting up 🤭",
        "YEA WTF WAS THAT",
        "not the SVPP hookup 😭",
        "Let’s talk about that Tuck 1 midterm.",
        "affirmations 🥰",
        "what has language come to.",
        "Be so phucking phor real",
        "Do aphis say BPHPHR instead of BFFR?",
        "McKinsey is Heorot. change my mind",
        "this year’s winter carnival theme is fucking ass 🚮",
        "I wanna eat a girl or guy out from the back",
        "yes some people are shy (i am people) ",
        "do I flitz someone on Datamatch who I’ve never met and hasn’t matched me back (yet?) 🫣 ",
        "datamatch can go kill itself ",
        "I wish all couples as sweet as Romeo and Juliet today🥰🥰🥰",
        "Staying in my dorm all day today cause I don’t wanna see cute V-Day decorations and couples holding hands 🥰🥰",
        "I’m single but the vibes today are immaculate idc. Maybe it’s the weather.",
        " ",
        "Is this beta",
        "Why do my earbuds just pop out of my ear",
        "Someone pls explain how me, a lesbian who only wanted to be datamatched with women, ended up matching with a dude named jack who appears to be a very straight cis male",
        "I pray on the downfall of everyone who has posted a couple pic on insta ",
        "🏳️‍🌈🏳️‍🌈",
        "David you’re a real one🫶🏽",
        "Happy Valentine’s Day 💔",
        "What frats have started rush activities?",
        "Alpha Chi having rush meals on Valentine’s Day is wild 💀",
        "Are there any companies in Boston that traditionally hire interns from Dartmouth?",
        "hot take as sometime taken: valentine’s day is pointless",
        "New phi delt dog?",
        "There is not one girl out there who would be upset / weirded out to get flowers on Valentine’s Day (cmon boys)",
        "same dude, gave him another 2 pm “good morning” and he hits me with a “bud you really got some stuff to work out” 😭",
        "propaganda @ foco",
        "Everyone who opened their datamatches, thought it was neat, and closed the app never to return",
        "the kid giving out lollipops to everyone in the lib 🥺",
        "Kids wanting to get into frat house",
        "3 am deer",
        "Putting my two ex-friends who hate each other as crushes into datamatch mwahahah",
        "i’m so excited to see my matches on datamatch tomorrow and then never talk to them 🥰",
        "Scenes tomorrow:\n— Robert’s Flowers of Hanover\n— Aisle 4 of CVS\n",
        "Vasanta for cancelling Test 3 and giving everyone a 20/20",
        "Prof Christesen for really brightening my day with the rose and the valentine, so kind of him to do this for a 150 person class",
        "Mentally preparing for the Instagram stories tmr",
        "mentally, i’m here",
        "Ngl I check mine like 30+ times a day. I get worried I’m going to miss something if I don’t ",
        "Too tired to even evacuate man fuck the McLaughlin fire alarm",
        "This is date rape. If you need to get someone drunk to sleep with them, you are predatory. Try to have sex that is mutually enjoyable. ",
        "update: i didn’t, goodbye.",
        "Here are some signs that you might secretly be attractive!!\n1. You have a lot of sex",
        "this could be SH 25, ER 25, CM 25, IH 25, YC 25, SB 25, LL 24, CS 24, CR 24, CK 24, KF 24, LD 24, ES 23, AR 23, AF 23, SM 23, or SC 22. and yes i did some intense stalking for this so plz answer ",
        "26 that snitched on half the class for accessing the midterm early, I hope you have a terrible four years",
        "Fuck Game Theory",
        "❤️",
        "there is no in between ",
        "26s when they learn that a 1600 sat score ≠ an A in econ 1 ",
        "Samara Cohen , thoughts?",
        "Just went in the cube basement holy shit",
        "a lot of people would be scared here… ",
        "group projects at Dartmouth :",
        "is this a psi u pledge task 😭",
        "dArTMouTh IsNT a CuLt",
        "i lost one of my favorite rings at beta 😭 it’s gold and has a little “I” on it. pls pls DM me if u find it",
        "Halloweecoming or Homoween ?",
        "Best night life places at Darrrmouth College? Help plessesess 🙏",
        "aphis and their bfs ",
        "they’re inPside Ur mom AND 1902!!!!!",
        "fizz is like group therapy but no one heals",
        "What are the frat sorority associations?",
        "PH 77 CAMEO",
        "goated ",
        "dart culture ",
        "Hanover right now 😁🥹",
        "This is what I’ve been saying. You clout chasers need to cut it with the BS!",
        "my ducks? in a row. ordered. disciplined. behaving unpredictably yet calculated. \n\nyour ducks? scattered. in disarray. waddling aimlessly. desperate for a leader to impose structure.\n\nloser. \n\n",
        "In response to DDS allegations of theft from Collis market. Y’all stay safe out there🫡",
        "New Darthub vid just dropped 🔥",
        "“We’re at capacity”",
        "Half a year, today 🫡",
        "Guys stop hating on the football team! They’re paying for my room and board this year! 🥹🥹🥰🥰",
        "California kids walking from Baker Berry to foco today",
        "How 25g’s are gonna be after they get cut from winter rush",
        "why the hell are people grinding already please let me have this last hour of peace",
        "These ranges are all over the place, bro take a stats class",
        "lol told a Harvard alum today that I never heard of Harvard and he was flabbergasted ",
        "My dog just had puppies, and my mom sent me the pics 🥹",
        "🔈PSA 🔈\nKEEP ON STEALING FROM DDS. I’ve heard from many who are too scared to steal. Share your strategies. Cover for a friend who is sneaking that core power in their pocket. We can’t be silenced!"
    ]
}